function ans = Runge_Kutta_Equs(t,f1,f2,w,h)
%仅用于解二阶一阶微分方程的方程组
N = length(t);
%函数的传入形式也要改变，不能直接传变量，而要传变量向量 ==>算了就单独针对2阶的方程组吧

for i=2:N
    k1_1 = h*f1(t(1,i-1),w(1,i-1),w(2,i-1));
    k1_2 = h*f2(t(1,i-1),w(1,i-1),w(2,i-1));
    
    k2_1 = h*f1(t(1,i-1)+h/2,w(1,i-1)+k1_1/2,w(2,i-1)+k1_2/2);
    k2_2 = h*f2(t(1,i-1)+h/2,w(1,i-1)+k1_1/2,w(2,i-1)+k1_1/2);
    
    k3_1 = h*f1(t(1,i-1)+h/2,w(1,i-1)+k2_1/2,w(2,i-1)+k2_2/2);
    k3_2 = h*f2(t(1,i-1)+h/2,w(1,i-1)+k2_1/2,w(2,i-1)+k2_2/2);
    
    k4_1 = h*f1(t(1,i),w(1,i-1)+k3_1,w(2,i-1)+k3_2);
    k4_2 = h*f2(t(1,i),w(1,i-1)+k3_1,w(2,i-1)+k3_2);
    
    w(1,i) = w(1,i-1) + (k1_1+2*k2_1+2*k3_1+k4_1)/6;
    w(2,i) = w(2,i-1) + (k1_2+2*k2_2+2*k3_2+k4_2)/6;

end
ans = w;